In [6]:
pip install pandas

Requirement already satisfied: pandas in c:\users\lenovo\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
ab={
    "id":[1,2,3,4,5,6,7,8,9,10],"email":['asrun','dummy','rest','best','suffer','food','utgghgf','kiygy','ikguhyg','oity'], "number":[36464,38655,68722228,84521787,894989,368114,33687,6987,36876,36414], "city":["lucknow","sitapur","hardoi","kanpur","agra","juytv","kuygvy","kityy","iutfj","kiyhyu"],"enrol":[6541,6841,6871,6781,4785,368713,3687,6781,7562,7856]
}

In [4]:
bc=pd.DataFrame(ab)

In [5]:
bc

   id    email    number     city   enrol
0   1    asrun     36464  lucknow    6541
1   2    dummy     38655  sitapur    6841
2   3     rest  68722228   hardoi    6871
3   4     best  84521787   kanpur    6781
4   5   suffer    894989     agra    4785
5   6     food    368114    juytv  368713
6   7  utgghgf     33687   kuygvy    3687
7   8    kiygy      6987    kityy    6781
8   9  ikguhyg     36876    iutfj    7562
9  10     oity     36414   kiyhyu    7856

In [7]:
type(bc)

pandas.core.frame.DataFrame

In [8]:
bc['city']

0    lucknow
1    sitapur
2     hardoi
3     kanpur
4       agra
5      juytv
6     kuygvy
7      kityy
8      iutfj
9     kiyhyu
Name: city, dtype: object

In [9]:
bc[['enrol','email']]

    enrol    email
0    6541    asrun
1    6841    dummy
2    6871     rest
3    6781     best
4    4785   suffer
5  368713     food
6    3687  utgghgf
7    6781    kiygy
8    7562  ikguhyg
9    7856     oity

In [10]:
bc.iloc[4]

id             5
email     suffer
number    894989
city        agra
enrol       4785
Name: 4, dtype: object

In [11]:
bc

   id    email    number     city   enrol
0   1    asrun     36464  lucknow    6541
1   2    dummy     38655  sitapur    6841
2   3     rest  68722228   hardoi    6871
3   4     best  84521787   kanpur    6781
4   5   suffer    894989     agra    4785
5   6     food    368114    juytv  368713
6   7  utgghgf     33687   kuygvy    3687
7   8    kiygy      6987    kityy    6781
8   9  ikguhyg     36876    iutfj    7562
9  10     oity     36414   kiyhyu    7856

In [12]:
a=bc.iloc[:2]
b=bc.iloc[7:10]

In [13]:
pd.concat([a,b])

   id    email  number     city  enrol
0   1    asrun   36464  lucknow   6541
1   2    dummy   38655  sitapur   6841
7   8    kiygy    6987    kityy   6781
8   9  ikguhyg   36876    iutfj   7562
9  10     oity   36414   kiyhyu   7856